feature(#113): update diagrams
